Catalogs/ПараметрыСоединенийСУБД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ПараметрыСоединенийСУБД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтрокаСоединения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСУБД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСУБД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыСУБД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыСУБД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>SQLite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MSSQLServer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MySQL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PostgreSQL</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПараметрыСоединенийСУБД/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьДляWebConfig(Команда)
	СформироватьДляWebConfigНаСервере();
	Док = Новый ТекстовыйДокумент;
	
	Док.ДобавитьСтроку("<!-- Скопируйте ключ в макет, входящий в подсистему СекцияConnectionStringsФайлаWebConfig -->");
	Док.ДобавитьСтроку("");
	Док.ДобавитьСтроку("        <add name=""" + Объект.Код + """ connectionString=""" + Объект.СтрокаСоединения + """ />");
	Док.ДобавитьСтроку("");
	Док.ДобавитьСтроку("<!-- Скопируйте ключ в макет, входящий в подсистему СекцияAppSettingsФайлаWebConfig -->");
	Док.ДобавитьСтроку("");
	Док.ДобавитьСтроку("    <add key=""" + Объект.Код + """ value=""" + ПолучитьТипСУБД() + """ />");
	Док.ДобавитьСтроку("");
	
	Док.Показать(Объект.Наименование);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьДляWebConfigНаСервере()
	// Вставить содержимое обработчик
КонецПроцедуры

&НаСервере
Функция ПолучитьТипСУБД()
	
	Если Объект.ТипСУБД = Перечисления.ТипыСУБД.SQLite Тогда
		Возврат "SQLite";
	ИначеЕсли Объект.ТипСУБД = Перечисления.ТипыСУБД.MSSQLServer Тогда
		Возврат "MSSQLServer";
	ИначеЕсли Объект.ТипСУБД = Перечисления.ТипыСУБД.MySQL Тогда
		Возврат "MySQL";
	ИначеЕсли Объект.ТипСУБД = Перечисления.ТипыСУБД.PostgreSQL Тогда
		Возврат "PostgreSQL";
	Иначе
		ВызватьИсключение "Неизвестный тип СУБД";
	КонецЕсли;
		
КонецФункции

#КонецОбласти
